ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/FSI_RX_FSI_RX_CFG_50290000h.xml
<module name="FSI_RX_CFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="FSI_RX_CFG_RX_MASTER_CTRL_ALTC" acronym="FSI_RX_CFG_RX_MASTER_CTRL_ALTC" offset="0" width="16" description="Receive master control register.">
		<bitfield id="KEY" width="8" begin="15" end="8" resetval="0x0" description="Write Key. In order to write to this register, 0xA5 must be written to this field at the same time. Otherwise, writes are ignored. The key is cleared immediately after Writing, so it must be written again for every change to this register." range="15:8" rwaccess="W"/>
	<bitfield id="DATA_FILTER_EN" width="1" begin="4" end="4" resetval="0x0" description="Data Filter Enable Bit. 0h[R/W] = Data filtering is disabled. 1h[R/W] = Data filtering is enabled." range="4" rwaccess="R/W"/>
	<bitfield id="INPUT_ISOLATE" width="1" begin="3" end="3" resetval="0x0" description="When set to 1, the FSI RX inputs [RXCLK, RXD0 and RXD1] will be isolated from what is driven from the device pins and will be held at inactive level of '1'.This isolation facilitates the user to switch the RX inputs to a different set of device pins and hence any potential glitch that could occur during the process of switching will not effect the RX module itself." range="3" rwaccess="R/W"/>
	<bitfield id="SPI_PAIRING" width="1" begin="2" end="2" resetval="0x0" description="Clock Pairing for SPI-like Behavior Enable bit This bit enables the internal clock pairing with the FSI TX module. This feature internally connects the TXCLK to RXCLK allowing the FSI TX module, acting as a SPI master, to clock data into the receiver and out of the transmitter like a standard SPI module. This configuration is valid when the Module is in SPI mode only [RX_OPER_CTRL.SPI_MODE = 1]  0h[R/W] = SPI clock pairing is not enabled. 1h[R/W] = SPI clock pairing is enabled. The RXCLK will be internally connected to the TXCLK of the corresponding FSI module.  Note: The KEY field must contatin 0xA5 for any write to this bit to take effect." range="2" rwaccess="R/W"/>
	<bitfield id="INT_LOOPBACK" width="1" begin="1" end="1" resetval="0x0" description="Internal Loopback Enable bit This bit enables the internal loopback functionality of the FSI receiver. By enabling this bit, a mux will select the signals coming directly from the corresponding FSI transmitter module rather than from the pins.  0h[R/W] = Internal loopback is disabled. The FSI RX module will receive signals coming from the pins. 1h[R/W] = Internal loopback is enabled. The FSI RX module will receive signals from the directly from FSI TX module rather than the pins.  Note: The KEY field must contatin 0xA5 for any write to this bit to take effect." range="1" rwaccess="R/W"/>
	<bitfield id="CORE_RST" width="1" begin="0" end="0" resetval="0x0" description="Receiver Controller Core Reset bit This bit controls the receiver master core reset. In order to receive any frame, this bit must be cleared. Note: For reset to take affect, the FSI RX module must be held in reset for at least 4 SYSCLK cycles.  0h[R/W] = Receiver core is not in reset and can receive frames. 1h[R/W] = Receiver core is held in reset.  Note: The KEY field must contatin 0xA5 for any write to this bit to take effect." range="0" rwaccess="R/W"/>
	</register><register id="FSI_RX_CFG_RX_OPER_CTRL" acronym="FSI_RX_CFG_RX_OPER_CTRL" offset="8" width="16" description="Receive operation control register.">
		<bitfield id="PING_WD_RST_MODE" width="1" begin="8" end="8" resetval="0x0" description="Ping Watchdog Timeout Mode Select bit This bit selects the mode by which the ping watchdog counter is reset. The watchdog counter can be reset and restarted only by ping frames or by any received frame.  0h[R/W] = The ping watchdog counter will reset and restart only by ping frames. 1h[R/W] = The ping watchdog counter will reset and restart by any received frame." range="8" rwaccess="R/W"/>
	<bitfield id="ECC_SEL" width="1" begin="7" end="7" resetval="0x0" description="ECC Data Width Select bit This bit selects between whether the ECC computation is done on 16-bit or 32-bit words.  0h[R/W] = 32-bit ECC is used. 1h[R/W] = 16-bit ECC is used." range="7" rwaccess="R/W"/>
	<bitfield id="N_WORDS" width="4" begin="6" end="3" resetval="0x0" description="Number of Words to Receive This field defines the number of words which will be received in a DATA_N_WORD frame. This is a user-defined field that must match the corresponding field in the transmitter. Set this bitfield to be one less than the number of words to be received. This value is only applicable when the frame type received is DATA_N_WORD.  0h[R/W] = 1 data word frame [16-bit data]. 1h[R/W] = 2 data word frame [32-bit data]. .. Fh [R/W] = 16 data word frame [256-bit data]." range="6:3" rwaccess="R/W"/>
	<bitfield id="SPI_MODE" width="1" begin="2" end="2" resetval="0x0" description="SPI Mode Enable bit This bit enables and disables the SPI compatibility mode of the FSI RX. The received data must be formatted as an FSI frame in order for the data to properly be received. SPI compatibility mode will allow FSI RX to receive data that is sent using SPI signal format. Refer to the applicable section in the FSI TRM chapter for more information.  0h[R/W] = FSI is in normal mode of operation. 1h[R/W] = FSI is operating in SPI compatibility mode." range="2" rwaccess="R/W"/>
	<bitfield id="DATA_WIDTH" width="2" begin="1" end="0" resetval="0x0" description="Receive Data Width Select bit These bits decide the number of data lines used for receiving data.   0h[R/W] = Data will be received on one data line, RXD0. 1h[R/W] = Data will be received on two data lines, RXD0 and RXD1. 2h3h[R/W] = Reserved" range="1:0" rwaccess="R/W"/>
	</register><register id="FSI_RX_CFG_RX_FRAME_INFO" acronym="FSI_RX_CFG_RX_FRAME_INFO" offset="12" width="16" description="Receive frame control register.">
		<bitfield id="FRAME_TYPE" width="4" begin="3" end="0" resetval="0x0" description="Received Frame Type This field indicates the type of frame that was successfully received last.  0000b[R/W] = A ping frame was received 0100b[R/W] = A DATA_1_WORD frame was received [16-bit data]. 0101b[R/W] = A DATA_2_WORD frame was received [32-bit data]. 0110b[R/W] = A DATA_4_WORD frame was received [64-bit data].  0111b[R/W] = A DATA_6_WORD frame was received [96-bit data]. 0011b[R/W] = A DATA_N_WORD frame was received. The N_WORD field will determine the number of words [1 to 16] to be sent. The number of words received must equal the value programmed in RX_OPER_CTRL.N_WORDS.  1111b[R/W] = An error frame was received. This frame can be used during error conditions or any condition where the transmitter wants to signal the receiver for attention. However, the user software is at liberty to use this for any purpose.  0001b0010b and1000bthrough1110bare Reserved and should not be used." range="3:0" rwaccess="R"/>
	</register><register id="FSI_RX_CFG_RX_FRAME_TAG_UDATA" acronym="FSI_RX_CFG_RX_FRAME_TAG_UDATA" offset="14" width="16" description="Receive frame tag and user data register.">
		<bitfield id="USER_DATA" width="8" begin="15" end="8" resetval="0x0" description="Received User Data This field contains the 8-bit user data field of the last successfully received frame." range="15:8" rwaccess="R"/>
	<bitfield id="FRAME_TAG" width="4" begin="4" end="1" resetval="0x0" description="Received Frame Tag This field contains the 4-bit frame tag from the last successfully received frame. This is intentionally shifted into bits 4:1 so that the register can be used as a 32-bit address index based on the received tag." range="4:1" rwaccess="R"/>
	<bitfield id="ZERO" width="1" begin="0" end="0" resetval="0x0" description="Zero bit This bit will always read  as 0. This is intentionally provided to create a 32-bit offset if required. Using the FRAME_TAG  and ZERO bits of this register [bits 4:0], application software can directly index into an array of 32-bit data." range="0" rwaccess="R"/>
	</register><register id="FSI_RX_CFG_RX_DMA_CTRL" acronym="FSI_RX_CFG_RX_DMA_CTRL" offset="16" width="16" description="Receive DMA event control register.">
		<bitfield id="DMA_EVT_EN" width="1" begin="0" end="0" resetval="0x0" description="DMA Event Enable bit This bit will enable a DMA Event to be generated upon the completion of a frame reception.  0h[R/W] = A DMA event will not be generated. 1h[R/W] = A DMA event will be generated upon the reception of a frame.  Note: The DMA event will only be generated for data frames." range="0" rwaccess="R/W"/>
	</register><register id="FSI_RX_CFG_RX_EVT_STS_ALT1" acronym="FSI_RX_CFG_RX_EVT_STS_ALT1" offset="20" width="16" description="Receive event and error status flag register.">
		<bitfield id="ERROR_TAG_MATCH" width="1" begin="14" end="14" resetval="0x0" description="Error Tag Match Flag This bit indicates that an error frame was received with a  tag comparison matching the masked tag reference. Software can also force this bit to get set by Writing to the RX_EVT_FRC register.   0h[R] = No  tag-matched error frame received. 1h[R] = A  tag-matched error frame has been received.   To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="14" rwaccess="R"/>
	<bitfield id="DATA_TAG_MATCH" width="1" begin="13" end="13" resetval="0x0" description="Data Tag Match Flag This bit indicates that a dataframe was received with a  tag comparison matching the masked tag reference. Software can also force this bit to get set by Writing to the RX_EVT_FRC register.   0h[R] = No tag-matched data frame received. 1h[R] = A tag-matched data frame has been received.   To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="13" rwaccess="R"/>
	<bitfield id="PING_TAG_MATCH" width="1" begin="12" end="12" resetval="0x0" description="Ping Tag Match Flag This bit indicates that a ping frame was received with a  tag comparison matching the masked tag reference. Software can also force this bit to get set by Writing to the RX_EVT_FRC register.   0h[R] = No tag-matched ping frame received. 1h[R] = A tag-matched ping frame has been received.   To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="12" rwaccess="R"/>
	<bitfield id="DATA_FRAME" width="1" begin="11" end="11" resetval="0x0" description="Data Frame Received Flag This bit indicates that an data frame has been received. Software can also force this bit to get set by Writing to the RX_EVT_FRC register.   0h[R] = No data frame has been received. 1h[R] = A data frame has been received.   To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="11" rwaccess="R"/>
	<bitfield id="FRAME_OVERRUN" width="1" begin="10" end="10" resetval="0x0" description="Frame Overrun Flag This bit indicates that a frame overrun condition has occured. This bit gets set to 1 when a new DATA/ERROR frame is received and the corresponding DATA_FRAME_RCVD/ERROR_FRAME_RCVD flag is still set to 1. Software can also force this bit to get set by Writing to the RX_EVT_FRC register.   0h[R] = Frame overrun has not ocurred. 1h[R] = Frame overrun has ocurred.   To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="10" rwaccess="R"/>
	<bitfield id="PING_FRAME" width="1" begin="9" end="9" resetval="0x0" description="Ping Frame Received Flag This bit indicates that an ping frame has been received. Software can also force this bit to get set by Writing to the RX_EVT_FRC register.   0h[R] = No ping frame has been received. 1h[R] = A ping frame has been received.   To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="9" rwaccess="R"/>
	<bitfield id="ERR_FRAME" width="1" begin="8" end="8" resetval="0x0" description="Error Frame Received Flag This bit indicates that an error frame has been received. Software can also force this bit to get set by Writing to the RX_EVT_FRC register.   0h[R] = No error frame has been received. 1h[R] = An error frame has been received.   To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="8" rwaccess="R"/>
	<bitfield id="BUF_UNDERRUN" width="1" begin="7" end="7" resetval="0x0" description="Receive Buffer Underrun Flag This bit indicates that a buffer underrun condition has occured in the receive buffer. This will happen when software reads the buffer which is empty and has no valid data. Software can also force this bit to get set by Writing to the RX_EVT_FRC register.   0h[R] = Receive Buffer Underrun has not ocurred. 1h[R] = Receive Buffer Underrun has ocurred.   To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="7" rwaccess="R"/>
	<bitfield id="FRAME_DONE" width="1" begin="6" end="6" resetval="0x0" description="Frame Done Flag This bit indicates that a frame has been successfully received without error. Software can also force this bit to get set by Writing to the RX_EVT_FRC register.   0h[R] = No frame has been successfully received. 1h[R] = A frame has been successfully received.   To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="6" rwaccess="R"/>
	<bitfield id="BUF_OVERRUN" width="1" begin="5" end="5" resetval="0x0" description="Receive Buffer Overrun Flag This bit indicates that a buffer overrun condition has occured in the receive buffer. Software can also force this bit to get set by Writing to the RX_EVT_FRC register.   0h[R] = Receive buffer overrun has not ocurred. 1h[R] = Receive buffer overrun has ocurred.   To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="5" rwaccess="R"/>
	<bitfield id="EOF_ERR" width="1" begin="4" end="4" resetval="0x0" description="End-of-Frame Error Flag This bit indicates that an invalid end-of-frame bit pattern has been received. Software can also force this bit to get set by Writing to the RX_EVT_FRC register.   0h[R] = Invalid end-of-frame has not been received. 1h[R] = Invalid end-of-frame has been received   To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="4" rwaccess="R"/>
	<bitfield id="TYPE_ERR" width="1" begin="3" end="3" resetval="0x0" description="Frame Type Error Flag This bit inditcates that an invalid frame type has been received. Software can also force this bit to get set by Writing to the RX_EVT_FRC register.   0h[R] = Invalid frame type has not been received. 1h[R] = Invalid frame type has been received   To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="3" rwaccess="R"/>
	<bitfield id="CRC_ERR" width="1" begin="2" end="2" resetval="0x0" description="CRC Error Flag This bit indicates that a CRC error has occured. A CRC error will be generated on a data frame where the received CRC and the computed CRC do not match. Software can also force this bit to get set by Writing to the RX_EVT_FRC register.   0h[R] = CRC error has not occured. 1h[R] = CRC error has occured.   To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="2" rwaccess="R"/>
	<bitfield id="FRAME_WD_TO" width="1" begin="1" end="1" resetval="0x0" description="Frame Watchdog Timeout Flag This bit indicates that the frame watchdog timer has timed out. Software can also force this bit to get set by Writing to the RX_EVT_FRC register.   0h[R] = Frame watchdog timeout has not occured. 1h[R] = Frame watchdog timeout has occured.   To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="1" rwaccess="R"/>
	<bitfield id="PING_WD_TO" width="1" begin="0" end="0" resetval="0x0" description="Ping Watchdog Timeout Flag This bit indicates that the ping watchdog timer has timed out. Software can also force this bit to get set by Writing to the RX_EVT_FRC register.   0h[R] = Ping watchdog timeout has not occured. 1h[R] = Ping watchdog timeout has occured.   To clear this bit, write to the corresponding bit in the RX_EVT_CLR register." range="0" rwaccess="R"/>
	</register><register id="FSI_RX_CFG_RX_CRC_INFO" acronym="FSI_RX_CFG_RX_CRC_INFO" offset="22" width="16" description="Receive CRC info of received and computed CRC.">
		<bitfield id="CALC_CRC" width="8" begin="15" end="8" resetval="0x0" description="Harware Calculated CRC Value This bitfield contains the CRC value that was calculated on the last received data. The contents of this bitfield are valid only when data frames are received.   Note: The contents of this bitfield are invalid for ping and error frames." range="15:8" rwaccess="R"/>
	<bitfield id="RX_CRC" width="8" begin="7" end="0" resetval="0x0" description="Received CRC Value This bitfield contains the CRC value that was last received a frame. The contents of this bitfield are valid only when data frames are received.   Note: The contents of this bitfield are invalid for ping and error frames." range="7:0" rwaccess="R"/>
	</register><register id="FSI_RX_CFG_RX_EVT_CLR_ALT1" acronym="FSI_RX_CFG_RX_EVT_CLR_ALT1" offset="24" width="16" description="Receive event and error clear register.">
		<bitfield id="ERROR_TAG_MATCH" width="1" begin="14" end="14" resetval="0x0" description="Error Tag Match Glag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="14" rwaccess="W"/>
	<bitfield id="DATA_TAG_MATCH" width="1" begin="13" end="13" resetval="0x0" description="Data Tag Match Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="13" rwaccess="W"/>
	<bitfield id="PING_TAG_MATCH" width="1" begin="12" end="12" resetval="0x0" description="Ping Tag Match Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="12" rwaccess="W"/>
	<bitfield id="DATA_FRAME" width="1" begin="11" end="11" resetval="0x0" description="Data Frame Received Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="11" rwaccess="W"/>
	<bitfield id="FRAME_OVERRUN" width="1" begin="10" end="10" resetval="0x0" description="Frame Overrun Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="10" rwaccess="W"/>
	<bitfield id="PING_FRAME" width="1" begin="9" end="9" resetval="0x0" description="Ping Frame Received Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="9" rwaccess="W"/>
	<bitfield id="ERR_FRAME" width="1" begin="8" end="8" resetval="0x0" description="Error Frame Received Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="8" rwaccess="W"/>
	<bitfield id="BUF_UNDERRUN" width="1" begin="7" end="7" resetval="0x0" description="Receive Buffer Underrun Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h[R/W] = Writing a 0 to this bit will have no effect. 1h[R/W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="7" rwaccess="W"/>
	<bitfield id="FRAME_DONE" width="1" begin="6" end="6" resetval="0x0" description="Frame Done Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="6" rwaccess="W"/>
	<bitfield id="BUF_OVERRUN" width="1" begin="5" end="5" resetval="0x0" description="Receive Buffer Overrun Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="5" rwaccess="W"/>
	<bitfield id="EOF_ERR" width="1" begin="4" end="4" resetval="0x0" description="End-of-Frame Error Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="4" rwaccess="W"/>
	<bitfield id="TYPE_ERR" width="1" begin="3" end="3" resetval="0x0" description="Frame Type Error Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="3" rwaccess="W"/>
	<bitfield id="CRC_ERR" width="1" begin="2" end="2" resetval="0x0" description="CRC Error Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="2" rwaccess="W"/>
	<bitfield id="FRAME_WD_TO" width="1" begin="1" end="1" resetval="0x0" description="Frame Watchdog Timeout Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="1" rwaccess="W"/>
	<bitfield id="PING_WD_TO" width="1" begin="0" end="0" resetval="0x0" description="Ping Watchdog Timeout Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="0" rwaccess="W"/>
	</register><register id="FSI_RX_CFG_RX_EVT_FRC_ALT1" acronym="FSI_RX_CFG_RX_EVT_FRC_ALT1" offset="26" width="16" description="Receive event and error flag force register.">
		<bitfield id="ERROR_TAG_MATCH" width="1" begin="14" end="14" resetval="0x0" description="Error Tag Match Flag Force bit This bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Force the corresponding bit in the RX_EVT_STS Register." range="14" rwaccess="W"/>
	<bitfield id="DATA_TAG_MATCH" width="1" begin="13" end="13" resetval="0x0" description="Data Tag Match Flag Force bit This bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h[W] = Writing a 0 to this bit will have no effect. 1h[W] = Force the corresponding bit in the RX_EVT_STS Register." range="13" rwaccess="W"/>
