ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/FSI_RX_FSI_RX_CFG_50290000h.xml
	<bitfield id="INT2_EN_PING_FRAME" width="1" begin="9" end="9" resetval="0x0" description="Enable Ping Frame Received Interrupt to INT2 bit This is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event.  0h[R/W] = This event will not trigger an interrupt on RX_INT2. 1h[R/W] = A ping frame received event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="9" rwaccess="R/W"/>
	<bitfield id="INT2_EN_ERR_FRAME" width="1" begin="8" end="8" resetval="0x0" description="Enable Error Frame Received Interrupt to INT2 bit This is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event.  0h[R/W] = This event will not trigger an interrupt on RX_INT2. 1h[R/W] = A error frame received event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="8" rwaccess="R/W"/>
	<bitfield id="INT2_EN_UNDERRUN" width="1" begin="7" end="7" resetval="0x0" description="Enable Buffer Underrun Interrupt to INT2 bit This is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event.  0h[R/W] = This event will not trigger an interrupt on RX_INT2. 1h[R/W] = A buffer underrun event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="7" rwaccess="R/W"/>
	<bitfield id="INT2_EN_FRAME_DONE" width="1" begin="6" end="6" resetval="0x0" description="Enable Frame Done Interrupt to INT2 bit This is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event.  0h[R/W] = This event will not trigger an interrupt on RX_INT2. 1h[R/W] = A frame done event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="6" rwaccess="R/W"/>
	<bitfield id="INT2_EN_OVERRUN" width="1" begin="5" end="5" resetval="0x0" description="Enable Buffer Overrun Interrupt to INT2 bit This is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event.  0h[R/W] = This event will not trigger an interrupt on RX_INT2. 1h[R/W] = A buffer overrun event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="5" rwaccess="R/W"/>
	<bitfield id="INT2_EN_EOF_ERR" width="1" begin="4" end="4" resetval="0x0" description="Enable End-of-Frame Error Interrupt to INT2 bit This is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event.  0h[R/W] = This event will not trigger an interrupt on RX_INT2. 1h[R/W] = An end-of-frame error event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="4" rwaccess="R/W"/>
	<bitfield id="INT2_EN_TYPE_ERR" width="1" begin="3" end="3" resetval="0x0" description="Enable Frame Type Error Interrupt to INT2 bit This is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event.  0h[R/W] = This event will not trigger an interrupt on RX_INT2. 1h[R/W] = A frame type error event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="3" rwaccess="R/W"/>
	<bitfield id="INT2_EN_CRC_ERR" width="1" begin="2" end="2" resetval="0x0" description="Enable CRC Error Interrupt to INT2 bit This is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event.  0h[R/W] = This event will not trigger an interrupt on RX_INT2. 1h[R/W] = A CRC error will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="2" rwaccess="R/W"/>
	<bitfield id="INT2_EN_FRAME_WD_TO" width="1" begin="1" end="1" resetval="0x0" description="Enable Frame Watchdog Timeout Interrupt to INT2 bit This is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event.  0h[R/W] = This event will not trigger an interrupt on RX_INT2. 1h[R/W] = A frame watchdog timeout event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="1" rwaccess="R/W"/>
	<bitfield id="INT2_EN_PING_WD_TO" width="1" begin="0" end="0" resetval="0x0" description="Enable Ping Watchdog Timeout Interrupt to INT2 bit This is an enable register which decides whether an interrupt [RX_INT2] will be generated on the enabled event.  0h[R/W] = This event will not trigger an interrupt on RX_INT2. 1h[R/W] = A ping watchdog timeout event will trigger an interrupt on RX_INT2. The event itself will be latched in the corresponding bit in the RX_EVT_STS Register" range="0" rwaccess="R/W"/>
	</register><register id="FSI_RX_CFG_RX_LOCK_CTRL" acronym="FSI_RX_CFG_RX_LOCK_CTRL" offset="60" width="16" description="Receive lock control register.">
		<bitfield id="KEY" width="8" begin="15" end="8" resetval="0x0" description="Write Key. In order to write to this register, 0xA5 must be written to this field at the same time. Otherwise, writes are ignored. The key is cleared immediately after Writing, so it must be written again for every change to this register." range="15:8" rwaccess="W"/>
	<bitfield id="LOCK" width="1" begin="0" end="0" resetval="0x0" description="Control Register Lock Enable bit This bit locks the contents of all the receive control registers that support a lock protection. Once locked, further writes will not take effect until SYSRS unlocks the register. Once set, further writes even to this bit will be ignored.  0h[R/W] = Receive control registers can be modified and are not locked. 1h[R/W] = Receive control registers are locked and cannot be modified until this bit is cleared by SYSRS. Any further writes to this bit are ignored.  Note: The KEY field must contatin 0xA5 for any write to this bit to take effect." range="0" rwaccess="R/W"/>
	</register><register id="FSI_RX_CFG_RX_ECC_DATA" acronym="FSI_RX_CFG_RX_ECC_DATA" offset="64" width="32" description="Receive ECC data register.">
		<bitfield id="DATA_HIGH" width="16" begin="31" end="16" resetval="0x0" description="Upper 16 bits of ECC Data Writing to this bitfield will cause the ECC logic to compute the ECC[SEC-DED] the entire 32-bit register and update TX_ECC_VAL register with the results. Software should write to these 16 bits of the register in a 32-bit write when needing to compute ECC for 32-bits for the full TX_ECC_DATA register." range="31:16" rwaccess="R/W"/>
	<bitfield id="DATA_LOW" width="16" begin="15" end="0" resetval="0x0" description="Lower 16 bits of ECC Data Writing to this bitfield will cause the ECC logic to compute the ECC[SEC-DED] for these 16 bits and update the TX_ECC_VAL register with the results. Software should write to these register bits as a 16-bit write when needing to compute ECC for 16-bits." range="15:0" rwaccess="R/W"/>
	</register><register id="FSI_RX_CFG_RX_ECC_VAL" acronym="FSI_RX_CFG_RX_ECC_VAL" offset="68" width="16" description="Receive ECC value register.">
		<bitfield id="ECC_VAL" width="7" begin="6" end="0" resetval="0x0" description="ECC Value for SEC-DED check This field contains the ECC value to be used for SEC-DED either for 16-bit or 32-bit data in the RX_ECC_DATA register." range="6:0" rwaccess="R/W"/>
	</register><register id="FSI_RX_CFG_RX_ECC_SEC_DATA" acronym="FSI_RX_CFG_RX_ECC_SEC_DATA" offset="72" width="32" description="Receive ECC corrected data register.">
		<bitfield id="SEC_DATA" width="32" begin="31" end="0" resetval="0x0" description="ECC Single Error Corrected Data The ECC corrected data will be available in this register. This value is valid only when there are no bit errors, or a single bit error was detected. Otherwise, the contents of this register are invalid and should not be used." range="31:0" rwaccess="R"/>
	</register><register id="FSI_RX_CFG_RX_ECC_LOG" acronym="FSI_RX_CFG_RX_ECC_LOG" offset="76" width="16" description="Receive ECC log and status register.">
		<bitfield id="MBE" width="1" begin="1" end="1" resetval="0x1" description="Multiple Bit Errors Detected This bit indicates the occurrence of multiple bit errors.The data is corrupted and cannot be corrected. If this bit is set, the data present in RX_ECC_SEC_DATA is invalid and should not be used.  0h[R] Multiple Bit Errors were not detected. Check the SBE bit for single bit errors. 1h[R] Multiple Bit Errors were detected. The data is not able to be corrected. The value present in RX_ECC_SEC_DATA is invalid and should not be used." range="1" rwaccess="R"/>
	<bitfield id="SBE" width="1" begin="0" end="0" resetval="0x1" description="Single Bit Error Detected This bit indicates the occurrence of a single bit error in the data. The data is autocorrected and placed into the RX_ECC_SEC_DATA register. This bit is valid only if MBE is 0.  0h[R] No bit errors were detected. The value in RX_ECC_SEC_DATA is correct.  1h[R] A single bit error was detected and corrected. The corrected data is present in RX_ECC_SEC_DATA." range="0" rwaccess="R"/>
	</register><register id="FSI_RX_CFG_RX_FRAME_TAG_CMP" acronym="FSI_RX_CFG_RX_FRAME_TAG_CMP" offset="80" width="16" description="Receive frame tag compare register.">
		<bitfield id="BROADCAST_EN" width="1" begin="9" end="9" resetval="0x0" description="Broadcast Enable bit This will enable the reception of a ping frame broadcast. When this bit is set, bit 3 of the received tag will be treated as a broadcast notification. If bit 3 of the received tag is set to 1, a ping tag match event will be triggered regardless of the. A match caused by the comparison of TAG_MASK and TAG_REF will still be considered a match and the frame tag match event will be triggered as normal  This bit only takes effect only if CMP_EN is set to 1.  0h[R/W] Broadcast frame match disabled. 1h[R/W] Broadcast frame match enabled." range="9" rwaccess="R/W"/>
	<bitfield id="CMP_EN" width="1" begin="8" end="8" resetval="0x0" description="Frame Tag Compare Enable bit Set this bit to enable the comparison of an incoming frame  tag and the value stored in the frame tag reference. A match caused by the comparison of TAG_MASK, TAG_REF, and the incoming frame tag will trigger the apprpriate frame tag match event.  0h[R/W] Frame tag comparison is disabled. 1h[R/W] Frame tag comparison is enabled." range="8" rwaccess="R/W"/>
	<bitfield id="TAG_MASK" width="4" begin="7" end="4" resetval="0x0" description="Frame Tag Mask Any bit position in this register set to 0 will be used in the comparison of the incoming frame tag and the value stored in TAG_REF. A bit position set to 1 will be ignored in the tag comparison.  This mask value is used only for non-ping frames. " range="7:4" rwaccess="R/W"/>
	<bitfield id="TAG_REF" width="4" begin="3" end="0" resetval="0x0" description="Frame Tag Reference The reference tag to check against when comparing the TAG_MASK and the incoming frame tag.  This reference value is used only for non-ping frames." range="3:0" rwaccess="R/W"/>
	</register><register id="FSI_RX_CFG_RX_PING_TAG_CMP" acronym="FSI_RX_CFG_RX_PING_TAG_CMP" offset="82" width="16" description="Receive ping tag compare register.">
		<bitfield id="BROADCAST_EN" width="1" begin="9" end="9" resetval="0x0" description="Broadcast Enable bit This will enable the reception of a ping frame broadcast. When this bit is set, bit 3 of the received tag will be treated as a broadcast notification. If bit 3 of the received tag is set to 1, a ping tag match event will be triggered regardless of the. A match caused by the comparison of TAG_MASK and TAG_REF will still be considered a match and the ping tag match event will be triggered as normal  This bit only takes effect only if CMP_EN is set to 1.  0h[R/W] Broadcast frame match disabled. 1h[R/W] Broadcast frame match enabled." range="9" rwaccess="R/W"/>
	<bitfield id="CMP_EN" width="1" begin="8" end="8" resetval="0x0" description="Ping Tag Compare Enable bit Set this bit to enable the comparison of an incoming ping tag and the value stored in the ping tag reference. A match caused by the comparison of TAG_MASK, TAG_REF, and the incoming ping tag will trigger a ping frame tag match event.  0h[R/W] Ping tag comparison is disabled. 1h[R/W] Ping tag comparison is enabled." range="8" rwaccess="R/W"/>
	<bitfield id="TAG_MASK" width="4" begin="7" end="4" resetval="0x0" description="Ping Tag Mask Any bit position in this register set to 0 will be used in the comparison of the incoming ping frame tag and the value stored in TAG_REF. A bit position set to 1 will be ignored in the tag comparison.  This mask value is used only for ping frames. " range="7:4" rwaccess="R/W"/>
	<bitfield id="TAG_REF" width="4" begin="3" end="0" resetval="0x0" description="Ping Tag Reference The reference tag to check against when comparing the TAG_MASK and the incoming ping tag.  This reference value is used only for ping frames." range="3:0" rwaccess="R/W"/>
	</register><register id="FSI_RX_CFG_RX_TRIG_CTRL_0" acronym="FSI_RX_CFG_RX_TRIG_CTRL_0" offset="88" width="32" description="Receive Trigger Control register 0">
		<bitfield id="RX_TRIG_DLY" width="24" begin="31" end="8" resetval="0x0" description="This is the 24 bit count of the trigger delay in SYSCLK cycles. If enabled, the Trigger-1 output of the trigger module will generate a 3 SYSCLK wide trigger pulse after the selected input trigger source sees a rising edge with a delay defined by this 24-bt value." range="31:8" rwaccess="R/W"/>
	<bitfield id="TRIG_SEL" width="4" begin="4" end="1" resetval="0x0" description="This is the mux Select Value which selects which of the inputs will be used as the trigger source." range="4:1" rwaccess="R/W"/>
	<bitfield id="TRIG_EN" width="1" begin="0" end="0" resetval="0x0" description="This is the enable for the RX output trigger generation. The output triggers will be generated only if this bit is set to 1. If this bit is 0, then no trigger will be generated by this module." range="0" rwaccess="R/W"/>
	</register><register id="FSI_RX_CFG_RX_TRIG_WIDTH_0" acronym="FSI_RX_CFG_RX_TRIG_WIDTH_0" offset="92" width="32" description="Receive Trigger Wdith register 0">
		<bitfield id="RX_TRIG_WIDTH" width="16" begin="15" end="0" resetval="0x0" description="This register decides the width[in SYSCLK cycles] of wide pulse output of the RX trigger module." range="15:0" rwaccess="R/W"/>
	</register><register id="FSI_RX_CFG_RX_DLYLINE_CTRL" acronym="FSI_RX_CFG_RX_DLYLINE_CTRL" offset="96" width="16" description="Receive delay line control register.">
		<bitfield id="RXD1_DLY" width="5" begin="14" end="10" resetval="0x0" description="Delay Line Tap Select for RXD1 This bitfield selects the number of delay elements inserted into the RXD1 path from the pin boundary to the receiver core.  0h[R/W] Zero delay elements are included in the RXD1 path. RXD1 is taken directly from the pin. 1h[R/W] One delay element is included in the RXD1 path. 2h[R/W] Two delay elements are included in the RXD1 path. ... 1Fh [R/W] 31 delay elements are included in the RXD1 path, the maximum." range="14:10" rwaccess="R/W"/>
	<bitfield id="RXD0_DLY" width="5" begin="9" end="5" resetval="0x0" description="Delay Line Tap Select for RXD0 This bitfield selects the number of delay elements inserted into the RXD0 path from the pin boundary to the receiver core.  0h[R/W] Zero delay elements are included in the RXD0 path. RXD0 is taken directly from the pin. 1h[R/W] One delay element is included in the RXD0 path. 2h[R/W] Two delay elements are included in the RXD0 path. ... 1Fh [R/W] 31 delay elements are included in the RXD0 path, the maximum." range="9:5" rwaccess="R/W"/>
	<bitfield id="RXCLK_DLY" width="5" begin="4" end="0" resetval="0x0" description="Delay Line Tap Select for RXCLK This bitfield selects the number of delay elements inserted into the RXCLK path from the pin boundary to the receiver core.  0h[R/W] Zero delay elements are included in the RXCLK path. RXCLK is taken directly from the pin. 1h[R/W] One delay element is included in the RXCLK path. 2h[R/W] Two delay elements are included in the RXCLK path. ... 1Fh [R/W] 31 delay elements are included in the RXCLK path, the maximum." range="4:0" rwaccess="R/W"/>
	</register><register id="FSI_RX_CFG_RX_TRIG_CTRL_1" acronym="FSI_RX_CFG_RX_TRIG_CTRL_1" offset="100" width="32" description="Receive Trigger Control register 1">
		<bitfield id="RX_TRIG_DLY" width="24" begin="31" end="8" resetval="0x0" description="This is the 24 bit count of the trigger delay in SYSCLK cycles. If enabled, the Trigger-1 output of the trigger module will generate a 3 SYSCLK wide trigger pulse after the selected input trigger source sees a rising edge with a delay defined by this 24-bt value." range="31:8" rwaccess="R/W"/>
	<bitfield id="TRIG_SEL" width="4" begin="4" end="1" resetval="0x0" description="This is the mux Select Value which selects which of the inputs will be used as the trigger source." range="4:1" rwaccess="R/W"/>
	<bitfield id="TRIG_EN" width="1" begin="0" end="0" resetval="0x0" description="This is the enable for the RX output trigger generation. The output triggers will be generated only if this bit is set to 1. If this bit is 0, then no trigger will be generated by this module." range="0" rwaccess="R/W"/>
	</register><register id="FSI_RX_CFG_RX_TRIG_CTRL_2" acronym="FSI_RX_CFG_RX_TRIG_CTRL_2" offset="104" width="32" description="Receive Trigger Control register 2">
		<bitfield id="RX_TRIG_DLY" width="24" begin="31" end="8" resetval="0x0" description="This is the 24 bit count of the trigger delay in SYSCLK cycles. If enabled, the Trigger-1 output of the trigger module will generate a 3 SYSCLK wide trigger pulse after the selected input trigger source sees a rising edge with a delay defined by this 24-bt value." range="31:8" rwaccess="R/W"/>
	<bitfield id="TRIG_SEL" width="4" begin="4" end="1" resetval="0x0" description="This is the mux Select Value which selects which of the inputs will be used as the trigger source." range="4:1" rwaccess="R/W"/>
	<bitfield id="TRIG_EN" width="1" begin="0" end="0" resetval="0x0" description="This is the enable for the RX output trigger generation. The output triggers will be generated only if this bit is set to 1. If this bit is 0, then no trigger will be generated by this module." range="0" rwaccess="R/W"/>
	</register><register id="FSI_RX_CFG_RX_TRIG_CTRL_3" acronym="FSI_RX_CFG_RX_TRIG_CTRL_3" offset="108" width="32" description="Receive Trigger Control register 3">
		<bitfield id="RX_TRIG_DLY" width="24" begin="31" end="8" resetval="0x0" description="This is the 24 bit count of the trigger delay in SYSCLK cycles. If enabled, the Trigger-1 output of the trigger module will generate a 3 SYSCLK wide trigger pulse after the selected input trigger source sees a rising edge with a delay defined by this 24-bt value." range="31:8" rwaccess="R/W"/>
	<bitfield id="TRIG_SEL" width="4" begin="4" end="1" resetval="0x0" description="This is the mux Select Value which selects which of the inputs will be used as the trigger source." range="4:1" rwaccess="R/W"/>
	<bitfield id="TRIG_EN" width="1" begin="0" end="0" resetval="0x0" description="This is the enable for the RX output trigger generation. The output triggers will be generated only if this bit is set to 1. If this bit is 0, then no trigger will be generated by this module." range="0" rwaccess="R/W"/>
	</register><register id="FSI_RX_CFG_RX_VIS_1" acronym="FSI_RX_CFG_RX_VIS_1" offset="112" width="32" description="Receive debug visibility register 1">
		<bitfield id="RX_CORE_STS" width="1" begin="3" end="3" resetval="0x0" description="Receiver Core Status bit This bit indicates the status of the receiver core. If this bit is set, the receiver should undergo a reset and subsequent resynchronization with the transmitter. This bit will be always be set when the receiver has detected and end of frame error or a frame type error. This bit can also be set if the receiver becomes corrupted due to noise on the signal lines. If the receiver has experienced a ping watchdog or frame watchdog timeout, this bit should be read to determine if the cause was due to a corrupt transaction, thus putting the receiver core into an unrecoverable state.  Only a soft reset will reset the recevier core and thus reset this bit.  0h[R] The receiver core is operating normally. 1h[R] The receiver core has entered into an error state and should be reset." range="3" rwaccess="R"/>
	</register><register id="FSI_RX_CFG_RX_UDATA_FILTER" acronym="FSI_RX_CFG_RX_UDATA_FILTER" offset="116" width="16" description="Receive User Data Filter Control register.">
		<bitfield id="UDATA_MASK" width="8" begin="15" end="8" resetval="0x0" description="Bit Mask to be used for comparing the USERDATA field when filtering is enabled. Every bit that is '1' in this register will be masked for comparison. If a bit position is '1', then it will be considered a successful match for that bit position." range="15:8" rwaccess="R/W"/>
	<bitfield id="UDATA_REG" width="8" begin="7" end="0" resetval="0x0" description="Reference to be used for comparing the USERDATA field when filtering is enabled." range="7:0" rwaccess="R/W"/>
	</register><register id="FSI_RX_CFG_RX_BUF_BASE_j" acronym="FSI_RX_CFG_RX_BUF_BASE_j" offset="128" width="16" description="Base address for receive data buffer.">
		<bitfield id="BASE_ADDRESS" width="16" begin="15" end="0" resetval="0x0" description="Receive Data Buffer Base Address This is the base address of the 16-word data buffer used by the receiver." range="15:0" rwaccess="R"/>
	</register>
</module>